In [2]:
#第六章 数据加载、存储与文件格式
#输入输出通常可以划分为几大类：读取文本文件和其他更高效的磁盘存储格式，加载数据库中的数据，
#利用Web API 操作网络资源
import pandas as pd

In [6]:
path=r'C:\Users\86139\Desktop\examples_data_for_data_analysis'
df=pd.read_csv(path+'\ex1.csv')

In [7]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
pd.read_table(path+'\ex1.csv',sep=',')

F:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [9]:
#可以让pandas为其分配默认的列名，也可以自己定义列名
pd.read_csv(path+'\ex2.csv',header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [10]:
pd.read_csv(path+'\ex2.csv',names=['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [11]:
#假设希望将message列作为DataFrame的索引,可以设置index_col
names=['a','b','c','d','message']
pd.read_csv(path+'\ex2.csv',names=names,index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [12]:
#如果希望将多个列做成一个层次化索引，只需传入由列编号或列名组成的列表即可：
parsed=pd.read_csv(path+'\csv_mindex.csv',index_col=['key1','key2'])

In [13]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [14]:
parsed=pd.read_csv(path+'\csv_mindex.csv')

In [15]:
parsed

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [19]:
#有些表格可能不是用固定的分隔符去分隔字段的（比如空白符或其他模式）
result=pd.read_table(path+'/ex3.txt',sep='\s+')
result

F:\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: read_table is deprecated, use read_csv instead.

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [20]:
#可以用skiprows跳过文件的第一行、第三行和第四行
pd.read_csv(path+'\ex4.csv',skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [21]:
pd.read_csv(path+'\ex4.csv')

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [24]:
#缺失值处理时文件解析任务当中的一个重要组成部分。缺失数据经常时要么没有（空字符串），要么用某个标记值表示。
#默认情况下，pandas会用一组经常出现的标记值进行识别，比如Na及Null
result=pd.read_csv(path+'\ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [25]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [26]:
#na_values可以用一个列表或集合的字符串表示缺失值
result=pd.read_csv(path+'/ex5.csv',na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [27]:
#字典的各列可以使用不同的NA标记值：
sentinels={'message':['foo','NA'],'something':['two']}
pd.read_csv(path+'/ex5.csv',na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [33]:
#逐块读取文本文件
#在看大文件之前，先设置pandas显示地更紧些：
pd.options.display.max_rows=10

In [34]:
result=pd.read_csv(path+'\ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [35]:
#如果只想读取几行（避免读取整个文件），通过nrows进行指定即可：
pd.read_csv(path+'\ex6.csv',nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [36]:
#要逐块读取文件，可以指定chunksize（行数）：
chunker=pd.read_csv(path+'\ex6.csv',chunksize=1000)
chunker

In [37]:
#read_csv所返回的这个TextParser对象使你可以根据chunksize对文件进行逐块迭代。
chunker=pd.read_csv(path+'\ex6.csv',chunksize=1000)
tot=pd.Series([])
for piece in chunker:
    tot=tot.add(piece['key'].value_counts(),fill_value=0)
tot=tot.sort_values(ascending=False)
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [38]:
#将数据写出到文本格式
#数据耶可以被输出为分隔符格式的文本。
data=pd.read_csv(path+'\ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [39]:
#利用to_csv写入
data.to_csv(path+'\out.csv')

In [40]:
#当然，还可以使用其他分隔符
import sys
data.to_csv(sys.stdout,sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [41]:
#缺失值在输出结果中会被表示为空字符串。
data.to_csv(sys.stdout,na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [42]:
#如果没有设置其他选项，则会写出行和列的标签。
data.to_csv(sys.stdout,index=False,header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [43]:
#此外，还可以只些一部分的列，并以你指定的顺序排列
data.to_csv(sys.stdout,index=False,columns=['a','b','c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [46]:
import numpy as np
#Series也有一个to_csv方法
dates=pd.date_range('1/1/2000',periods=7)
ts=pd.Series(np.arange(7),index=dates)
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

In [49]:
ts.to_csv(path+'/tseries.csv')

F:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  """Entry point for launching an IPython kernel.

In [52]:
#处理分隔符格式
#大部分存储在磁盘上的表格型数据都能用pandas.read_table进行加载
#对于任何单字符分隔符文件，可以直接使用Python内置的csv模块。将任意已打开的文件或文件型的对象传给scv.reader
import csv
f=open(path+'\ex7.csv')
reader=csv.reader(f)
#对这个reader进行迭代将会为每行产生一个元组（并移除了所有的引号）：对这个reader进行迭代将会为每行产生一个元组（并移除了所有的引号）
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [53]:
#读取文件到一个多行的列表中：
with open(path+'\ex7.csv')as f:
    lines=list(csv.reader(f))
#将这些行分为标题行和数据行
header,values=lines[0],lines[1:]
#我们可以用字典构造式和zip(*values),后者将行转置为列，创建数据列的字典：
data_dict={h:v for h,v in zip(header,zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [55]:
#csv文件的形式有很多。只需定义csv.Dialect的一个子类即可定义出新格式
class my_dialect(csv.Dialect):
    lineterminator='\n'
    delimiter=';'
    quotechar='""'
    quoting=csv.QUOTE_MINIMAL
#reader=csv.reader(f,dialect=my_dialect)
#reader=csv.reader(f,delimiter='|')

In [59]:
with open(path+'\mydata.csv','w')as f:
    writer=csv.writer(f)
    writer.writerow(('one','two','three'))
    writer.writerow(('1','2','3'))
    writer.writerow(('4','5','6'))
    writer.writerow(('7','8','9'))

In [62]:
#JSON数据
#Json已经成为通过HTTP请求在Web浏览器和其他应用程序之间发送数据的标准格式之一。它是一种比表格型文本格式灵活得多得数据格式
obj='''{
	"name": "Wes",
	"places_lived": ["United States", "Spain", "Germany"],
	"pet": null,
	"siblings": [{
			"name": "Scott",
			"age": 30,
			"pets": ["Zeus", "Zuko"]
		},
		{
			"name": "Katie",
			"age": 38,
			"pets": ["Sixes", "Stache", "Cisco"]
		}
	]
}'''
#json中所有得键都必须是字符串。许多Python库都可以读写JSON数据

In [63]:
import json
result=json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [64]:
asjson=json.dumps(result)
siblings=pd.DataFrame(result['siblings'],columns=['name','age'])
siblings

    name  age
0  Scott   30
1  Katie   38

In [65]:
#pandas.read_json可以自动将特别格式的JSON数据集转换为Series或DataFrame
data=pd.read_json(path+'\example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [66]:
#如果需要将数据从panda输出到Json，可以使用to_json
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [67]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [69]:
#XML和HTML：Web信息收集
#python有许多可读写常见的HTML和XML格式数据的库，包括lxml，Beautiful Soup 和html5lib。
#pandas有一个内置功能，read_html,它可以使用lxml和Beautiful Soup 自动将HTML文件中的表格解析为DataFrame
tables=pd.read_html(path+'/fdic_failed_bank_list.html')
tables

[                             Bank Name             City  ST   CERT  \
 0                          Allied Bank         Mulberry  AR     91
 1         The Woodbury Banking Company         Woodbury  GA  11297
 2               First CornerStone Bank  King of Prussia  PA  35312
 3                   Trust Company Bank          Memphis  TN   9956
 4           North Milwaukee State Bank        Milwaukee  WI  20364
 ..                                 ...              ...  ..    ...
 542                 Superior Bank, FSB         Hinsdale  IL  32646
 543                Malta National Bank            Malta  OH   6629
 544    First Alliance Bank & Trust Co.       Manchester  NH  34264
 545  National State Bank of Metropolis       Metropolis  IL   3815
 546                   Bank of Honolulu         Honolulu  HI  21029

                    Acquiring Institution        Closing Date  \
 0                           Today's Bank  September 23, 2016
 1                            United Bank     August 19, 2016
 2    First-Citizens Bank & Trust Company         May 6, 2016
 3             The Bank of Fayette County      April 29, 2016
 4    First-Citizens Bank & Trust Company      March 11, 2016
 ..                                   ...                 ...
 542                Superior Federal, FSB       July 27, 2001
 543                    North Valley Bank         May 3, 2001
 544  Southern New Hampshire Bank & Trust    February 2, 2001
 545              Banterra Bank of Marion   December 14, 2000
 546                   Bank of the Orient    October 13, 2000

           Updated Date
 0    November 17, 2016
 1    November 17, 2016
 2    September 6, 2016
 3    September 6, 2016
 4        June 16, 2016
 ..                 ...
 542    August 19, 2014
 543  November 18, 2002
 544  February 18, 2003
 545     March 17, 2005
 546     March 17, 2005

 [547 rows x 7 columns]]

In [73]:
failures = tables[0]

In [74]:
#计算按年份计算倒闭的银行数
close_timestamps=pd.to_datetime(failures['Closing Date'])
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

In [75]:
#利用lxml.objectify解析XML
#先用lxml.objectify解析该文件，然后通过getroot得到该XML文件的根节点的引用
from lxml import objectify

In [113]:
pathxml=path+'r/datasets/mta_perf/Performance_MNR.xml'
#parsed=objectify.parse(open(path))

In [81]:
#6.2二进制数据格式
frame=pd.read_csv(path+'\ex1.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [83]:
#可以通过pickle直接读取被pickle化的数据，或是使用更为方便的pandas.read_pickle:
pd.read_pickle(path+'/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [84]:
#注意：pickle仅建议用于短期存储格式。其原因是很难保证该格式永远是稳定的
#HDF5是一种存储大规模科学数组数据的非常好的文件格式，它可以被作为C标准库,带有许多语言的借款，如Java,Python,Matlab等
frame=pd.DataFrame({'a':np.random.randn(100)})
store=pd.HDFStore('mydata.h5')
store['obj1']=frame
store['obj1_col']=frame['a']
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [85]:
#HDF5文件中的对象可以通过与字典一样的API进行获取
store['obj1']

           a
0   0.517214
1   0.607324
2  -0.209934
3  -0.384790
4  -0.186223
..       ...
95  0.815586
96  1.290558
97 -0.641804
98 -1.156545
99  0.032524

[100 rows x 1 columns]

In [86]:
#HDFStore支持两种存储模式，'fixed'和‘table'后者通常会更慢，但支持使用特殊语法进行查询
store.put('obj2',frame,format='table')
store.select('obj2',where=['index>=10 and index<=15'])

           a
10  1.208027
11  1.700374
12 -1.334118
13  0.038022
14  0.355092
15 -1.048459

In [89]:
frame.to_hdf('mydata.h5','obj3',format='table')

In [90]:
pd.read_hdf(path+'/mydata.h5','obj3',where=['index<5'])

          a
0  1.324210
1  0.770813
2  0.554799
3 -1.741867
4 -1.875071

In [91]:
#读取excel文件
#pandas的ExcelFile类或pandas.read_excel函数支持读取存储在EXCEL2003（或更高版本）中的表格数据
#这两个工具分别使用扩展包xlrd和openpyxl读取xls和xlsx
xlsx=pd.ExcelFile(path+'/ex1.xlsx')

In [92]:
pd.read_excel(xlsx,'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [93]:
#如果读取一个文件中的多个表单，创建ExcelFile会更快，也可以将文件名直接传递到pandas.read_excel
frame=pd.read_excel(path+'/ex1.xlsx','Sheet1')
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [95]:
#如果要将pandas数据写入Excel格式，必须创建一个ExcelWriter，然后使用pandas对象的to_excel方法将数据谢日其中
writer=pd.ExcelWriter(path+'/ex2.xlsx')
frame.to_excel(writer,'Sheet1')
writer.save()

In [96]:
frame.to_excel(path+'/ex2.xlsx')

In [97]:
#6.3Web APIs交互
import requests
url='https://api.github.com/repos/pandas-dev/pandas/issues'
resp=requests.get(url)
resp

In [98]:
data=resp.json()

In [99]:
data[0]['title']

'BUG: to_numpy on categorical data with tz aware datetime categories returns datetime64'

In [101]:
issues=pd.DataFrame(data,columns=['number','title','labels','state'],)
issues

,number,title,labels,state
0,26406,BUG: to_numpy on categorical data with tz awar...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
1,26405,DEPR: deprecate Series/DataFrame.compound,"[{'id': 87485152, 'node_id': 'MDU6TGFiZWw4NzQ4...",open
2,26404,Fix type annotations in pandas.core.indexes.da...,[],open
3,26403,DEPR: Deprecate ordered=None for CategoricalDtype,"[{'id': 78527356, 'node_id': 'MDU6TGFiZWw3ODUy...",open
4,26402,DOC: Test doctests in pandas/core/tools/dateti...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
...,...,...,...,...
25,26377,Fix type annotations in pandas.core.ops,"[{'id': 1280988427, 'node_id': 'MDU6TGFiZWwxMj...",open
26,26376,pd.read_fwf fails with file pointer to url,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
27,26374,BUG: ngroups and len(groups) do not equal when...,"[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open
28,26372,Misc Type Annotation fixes,"[{'id': 1280988427, 'node_id': 'MDU6TGFiZWwxMj...",open
29,26370,Feature requests: pandas.DataFrame.quantile wi...,[],open

In [124]:
#数据库交互
import sqlite3
query='''
CREATE TABLE test3
(a VARCHAR(20),b VARCHAR(20),c Real, d INTEGER);
'''
con=sqlite3.connect('mydata1.sqlite')

In [125]:
con.execute(query)

In [126]:
con.commit()

In [128]:
data=[('Atlanta','Georgia',1.25,6),
     ('Tallahassee','Florida',2.6,3),
     ('Sacramento','California',1.7,5)]
stmt='INSERT INTO test3 VALUES(?,?,?,?)'
con.executemany(stmt,data)

In [129]:
#从表中选取数据时，大部分Python SQL驱动器（PyODBC、psycopg2、MySQLdb、
#pymssql等）都会返回一个元组列表：
cursor=con.execute('select * from test3')
rows=cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [130]:
#你可以将这个元组列表传给DataFrame构造器，但还需要列名（位于光标的description属性中）：
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [131]:
pd.DataFrame(rows,columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [132]:
import sqlalchemy as sqla
db=sqla.create_engine('sqlite:///mydata1.sqlite')
pd.read_sql('select * from test3',db)

Empty DataFrame
Columns: [a, b, c, d]
Index: []